In [82]:
import pandas as pd

In [83]:
df = pd.read_csv("./titanic.csv")

In [84]:
#Carregue o dataset em um DataFrame Pandas e mostre as primeiras 3 linhas.
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [85]:
#Mostrar head do DF
  
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [86]:
#Deleção de colunas (o output removerá colunas duplicadas)
df = df.drop_duplicates()
df.shape

#E aqui removerá valores nulos em colunas específicas
df = df.dropna(subset=['Age', 'Embarked'])
df.shape

(712, 12)

In [87]:
#Sort de valores (no caso, o output será da menor idade à maior)
df = df.sort_values(by='Age')

In [88]:
#Remoção de nulos
df = df.dropna()

In [89]:
#Lista de colunas
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [90]:
#Criar cópia do dataframe inicial
df_copy = df.copy()

In [91]:
 #Reset de index
df = df.reset_index(drop=True)

In [122]:
# Dois insights gerados a partir de dataset - maioria masculina
contagem_genero = df['Sexo'].value_counts()
print(contagem_genero)

Sexo
male      95
female    88
Name: count, dtype: int64

In [123]:
# Dois insights gerados a partir de dataset - maioria da classe 1
contagem_classe = df['Classe econômica'].value_counts()
print(contagem_classe)

Classe econômica
1    158
2     15
3     10
Name: count, dtype: int64

In [126]:
# Salvar o DataFrame final em um arquivo CSV
df.to_csv('./output_titanic.csv', index=False)

In [92]:
#Bônus: Traduzir colunas do inglês para o português (opcional)
df = df.rename(columns={'PassengerId': 'Id de Passageiro', 'Survived': 'Sobrevivente', 'Name': 'Nome', 'Sex': 'Sexo', 'Age': 'Idade', 'Parch': 'Filhos', 'Pclass': 'Classe econômica', 'Cabin': 'Cabine', 'Ticket': 'Número do ticket', 'Embarked': 'Sigla de origem', 'SibSp': 'Número de irmãos/conjuges a bordo' })
print(df.columns)

Index(['Id de Passageiro', 'Sobrevivente', 'Classe econômica', 'Nome', 'Sexo',
       'Idade', 'Número de irmãos/conjuges a bordo', 'Filhos',
       'Número do ticket', 'Fare', 'Cabine', 'Sigla de origem'],
      dtype='object')